[
  {
    "path": "posts/2021-03-10-dataviz-makeover-3/",
    "title": "The third DataViz Makeover",
    "description": "ISSS608 Visual Analytics and Applications - DataViz Makeover 3",
    "author": [
      {
        "name": "Amanda",
        "url": "https://example.com/amandatwl"
      }
    ],
    "date": "2021-03-10",
    "categories": [],
    "contents": "\r\nThe Data Visualisation\r\nThe South-east Asia Armed Conflict Analysis is a data visualisation created to reveal spatio-temporal patterns of armed conflict in selected South-east Asia countries between 2015-2020. The link to the interactive visualisation can be found here.\r\nSpatio-temporal patterns of armed conflict in selected Southeast Asia countries between 2015-2020(a) Critique of current visualisation\r\nThere are three evaluation criteria in this critique: (i) clarity; (ii) aesthetics; and (iii) interactivity. Each criterion will be discussed individually, and discussion points that cut across criterion will be placed with the main criterion that it falls under, with highlights on how the other criteria are affected.\r\nClarity\r\n1) Appropriate choice of map and line graph\r\nThe choice of map to show the location of armed conflict events, encoded by colour and shape to differentiate the different types of armed conflict events, is good as the audience can perceive location together with distance on a map better and other patterns of the data can also surface with the use of the colour and shape scales.\r\nThe line graphs are also appropriate to show the trend of armed conflict events over time.\r\n2) Unable to see data points clearly when clustered together on the map\r\nIn areas with high number and variety of armed conflict events, the data points on the map overlap. As the data points are opaque with no borders, this results in two issues, discussed below.\r\nA) Difficulty in identifying the number of data points of the same colour\r\nThe main purpose of the map is to show the location of armed conflict events. In locations with high number of events, the map would provide the intensity of events, depicted by the number of data points in the area. As seen from the diagram below, it is difficult to differentiate the data points of the same colour as they form one big mass due to the lack of borders or outlines. This reduces the clarity on the number of armed conflict events happening within the area.\r\nData points form masses due to lack of outlinesB) Unable to tell if there are any data points (and its colour) covered by the data point at top layer\r\nAt the country level (zoomed-out view), the overlapping of the opaque data points causes those data points at the bottom layers to be obscured by the data points at the top layer, as shown in the diagram below. As such, the audience has no clarity on the other types of armed conflict events that occur within the area.\r\nData points at top layer obscuring data points at bottom layersAnother problem that the opaque data point causes is that the audience is unable to tell the name of the area when the data points occur where the names of the area are placed. In the diagram below, the word “Myanmar” could hardly be seen although we could argue that the general public could still make out the word “Myanmar” due to familiarity. However, if we go down to the division/state/region level, one who is not familiar with the Myanmar system would not be able to make out the names of the divisions/states/regions that are fully/partially obscured by the data points, e.g. “Chin” and “Naypyitaw” in the diagram below.\r\nData points at top layer obscuring data points at bottom layers3) Information in map data point tooltip not useful\r\nIn the interactive version of the visualisation, a tooltip (see diagram below) is shown when mousing over each data point on the map. The Event Id Cnty shows the individual event identifier by number and country acronym; the Event Type shows the type of armed conflict event; and the Latitude and Longitude show the latitude and longitude of the location respectively. The Event Id Cnty, Latitude and Longitude are very specific and too detailed, which does not value-add in the understanding of spatio-temporal patterns of armed conflict in the area.\r\nTooltip information not useful4) Issues with y-axis range in line graphs\r\nThe line graphs are repeated plots representing different event types over time, shown in a vertical fashion. It is not quite a trellis chart, as the range of each y-axis differs across the different line graphs. Another issue is that the line graphs do not start at zero. Although the pattern of the number of armed conflict event over time is clearly shown for each event type (allowing a more visual comparison of the pattern), the line graphs mislead the audience into overestimating or underestimating the number of events. To illustrate the point, let us take a closer look at the line graphs for Protests and Strategic developments.\r\nLine graphs for Protests and Strategic developments event typesThe number of Protests in 2020 decreased drastically from 2019, whereas the number of Strategic developments has seen a steady increase from past years. The graph patterns seem to indicate that Strategic development has a much higher number of events than Protests, and that the number of Protests is close to zero, but it is not so when we compare the values! In 2020, the number of Protests is about 125-130, and the number of Strategic development events is about 150.\r\n5) Order of event types in line graphs not intuitive\r\nAt first glance, the order in which the line graphs are arranged vertically is not clear, a result of different ranges in the line graphs as discussed earlier. Upon a closer look, the sort icon in the x-axis indicates that the line graphs are sorted in descending order. However, this is still not apparent from the line graphs themselves, and require the audience to trace the number of events across line graphs in order to understand the sorting.\r\nLine graphs sorted in descending order6) Different data aggregation in map and line graphs\r\nThe map displays the total number of armed conflicts in the six years, whereas the line graphs display the annual number of armed conflicts over the six years. As the data aggregation is different, the audience is unable to visualise the combined effect of the spatio pattern and temporal pattern of the data, i.e. cannot tell what is the trend of armed conflict events over time of a specific region of the country.\r\nAesthetics\r\n1) Issues with shape encoding on map\r\nThere is shape encoding in the map visualisation, however, the size of the data points is too small for the audience to make out the shape unless one scrutinises the data points or has a sharp eye for details. The size of the data points remain unchanged even after zooming in.\r\nSize of data points too small to see the shapeFrom the diagram above, we can see that there is no legend to inform on the shape encoding. It is not clear what is being encoded by the shape. In addition, there is no differentiation in the data point tooltip information for the audience to make a guess at what the shape encodes. This reduces the clarity of the shape aesthetic.\r\nTooltip for blue circle data pointTooltip for blue square data point2) Good amount of non-data ink for the line graphs\r\nThere is a good amount of non-data ink for the line graphs, making the design clean and easy to read.\r\nAs the graph titles are usually placed at the top or bottom of graphs, the label Event Type at the top of the graphs direct the audience to where the title actually is. Putting the graph titles at the side also allows for easier vertical comparison of the data without any visual interruption, but we could also argue that the eye needs to go left and right in order to identify which line graph is for which event type.\r\nEvent Type label shows where the graph titles areOn the other hand, the label Event Date may be misleading as only the year component of the event dates are shown in the x-axis. As the x-axis labels are only at the bottom, it is a relatively long distance to trace between the first graph at the top to the x-axis labels to identify the corresponding year for each data point in the line graphs. It would be better if Event Date is replaced with year labels repeated at top. There is no need for the Year x-axis title as it will be intuitive that year is being represented on the x-axis with the labels themselves.\r\nEvent Date label not necessary as x-axis labels is able to show that year ie being depictedThe y-axis titles for the line graphs do not provide value to the audience as it refers to a Sheet1 that the audience have no idea about and no access to. Furthermore, the y-axis title is orientated vertically and is repeated for each line graph, which makes it harder to read and does not value-add in understanding what the line graphs are plotted against.\r\nDifficult to understand and read y-axis titles3) Colour scale not employed across graphs\r\nThe map uses colour to encode the event type (mapping shown in the legend on the right), however the line graph uses the same colour blue as Battles in the map, for all the event types. Furthermore, colour perception is more powerful and efficient than reading and understanding textual description, i.e. graph titles. This means that the audience would need to work harder in linking and de-linking colours, and reading the graph titles, when switching between the map and line graphs.\r\n4) Position of colour legend too far from map\r\nAs the colour scales are only used in the map, the audience need to trace horizontally across the entire visualisation to refer to the colour legend. The legend should be placed appropriately near to where the colour scale is used for the audience to have easy reference.\r\nInteractivity\r\n1) Basic map interactivity provided\r\n2) Action on one graph\r\n3)\r\n(b) Proposed design\r\n(c) Final product of proposed visualisation\r\nThe proposed visualisation is designed using Tableau and uploaded on Tableau Public. The link can be found here.\r\n(d) Step-by-step description to prepare the final product\r\n(e) Major observations revealed by the final product\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-03-12T18:08:05+08:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-02-09-dataviz-makeover-2/",
    "title": "The second DataViz Makeover",
    "description": "ISSS608 Visual Analytics and Applications - DataViz Makeover 2",
    "author": [
      {
        "name": "Amanda",
        "url": "https://example.com/amandatwl"
      }
    ],
    "date": "2021-02-09",
    "categories": [],
    "contents": "\r\nThe Data Visualisation\r\nTwo data visualisations on understanding the willingness of the public on COVID-19 vaccination(a) Critique of current visualisation\r\nClarity\r\n1. Layout of the graph elements in the visualisation\r\nThe graph titles are obvious and the audience is able to visually group the title with the corresponding graph. However, it is not clear if the title “Which country is more pro-vacinne?” is intended for the graph on the left only or for both graphs, as the title seems broad and could be applicable to both graphs (side note: vaccine is misspelt in the title).\r\nThe placement of the legend should be beside the graph (on the left) that the audience need to reference to more often, so that it is clear to the audience the colour encoding of the graph, and also to reduce the distance that the audience needs to visually trace between the graph and the legend.\r\n2. Partial colour encoding indicated in the legend\r\nThe legend only indicated the levels (i.e. 1 and 5) with a short description for the first and last colours, and only the levels (i.e. 2, 3 and 4) for the middle three colours. To make it clear to the audience what each colour stands for, and for consistency, the short description should be added for the middle three colours as well. It is noted that the data source did not include the short description for the middle values.\r\nLegendIn addition, the title of the legend “Vac 1” does not convey clearly what the legend is for.\r\n3. Misleading graph title for the data in the graph on the left\r\nAt a cursory glance, the audience is led to think that there are two different messages being conveyed in the data visualisation due to (a) the wording of the titles; and (b) more categories being observed in the graph on the left (made more visually prominent by differences in the colours used in the two graphs).\r\nUpon a closer look, the data in the graph on the left is based on the categories of a 5-point Likert scale. Comparing with the graph on the right, the audience then realises that the blue bars match for the two graphs. As the graph on the right clearly states that the data reflects the “% of strongly agreed to vaccination”, this suggests that the graph on the left is based on the full spectrum of responses answering the same question on vaccination for each country. Here, the creator assumed that the indicator of a country being “pro-vaccine” is represented by the percentage of survey respondents who agreed or disagreed to vaccination, and misleads the audience to think this way too.\r\n4. Graph title not useful for the graph on the right\r\nThe visualisation is based on a survey on the willingness of the public on Covid-19 vaccination, and the data on the field “vac_1: If a Covid-19 vaccine were made available to me this week, I would definitely get it:” is used to plot the graphs. Although the graph title indicates that the visualisation is showing the “% of strongly agreed to vaccination”, it is not clear to the audience that the vaccination is for Covid-19 and not other viruses.\r\nIn addition, there are several variations to the question asked in vac_1 with the same values, in the survey, which is shown in the table below:\r\nField\r\nQuestion\r\nvac_1\r\nIf a Covid-19 vaccine were made available to me this week, I would definitely get it:\r\nvac_2\r\nIf a Covid-19 vaccine becomes available to me in 2021, I definitely intend to get it.\r\nvac_3\r\nIf a Covid-19 vaccine becomes available to me a year from now, I definitely intend to get it\r\nFor someone who knows the survey and the questions asked, it is not clear which question’s data is the visualisation based on. Even if the small print “Vac 1” in the legend is noted, it will require some work on the part of the audience to try to remember or to find out what it means, which defeats the purpose of visualisations in facilitating analytical reasoning.\r\n5. Selection of countries not explained in the visualisation\r\nThe creator selected 14 out of the 30 countries surveyed to include in the visualisation. The reasons for the choice of countries are not included in the visualisation and may mislead the audience to think that the 14 countries shown are either the only countries that were surveyed or the top-14 countries that have the highest percentage of strongly agreed to vaccination. It was also noted that prominent countries like China and United States were missing in the visualisation.\r\nUpon further investigation of the dataset, it was found that the remaining countries (Brazil, China, Hong Kong, India, Indonesia, Malaysia, Mexico, Philippines, Saudi Arabia, Taiwan, Thailand, United Arab Emirates, United States and Vietnam) do not have the vaccination fields in the dataset, and the data from Israel is recently added from 29/01/2021 onwards. These were likely the reasons for the exclusion in the visualisation, which the creator did not attempt to explain to provide clarity.\r\nIn addition, Spain is excluded in the visualisation when valid data is available.\r\n6. Good use of chart type and chart orientation\r\nThe use of the stacked bar chart on the left allows for meaningful comparison of the categories across countries, as well as within each country. Each bar is split into five categories, which is manageable for the audience to make moderately accurate visual comparisons. For both graphs, the x-axes start at zero, which gives a good representation and proportion of the percentage data shown.\r\n(i) Able to make moderately accurate visual comparisons; (ii) x-axis starts at zeroThe charts are placed horizontally, instead of vertically, which allows the audience to easily read the country labels.\r\n7. Data ordered differently in both graphs\r\nThe two graphs are ordered differently, left in alphabetic order of the country name and right in descending data value order. Assuming that the intent of the graph on the right is for the audience to have a detailed view of the percentage values (which is difficult to read from the stacked bar graph on the left), the difference in the ordering makes it challenging to find a specific country in the graph on the right. For example, if I am interested in France after looking at her distribution of responses in the graph on the left, I need to scan through the list of countries in the graph on the right to find France. This “eye-balling” action (left-right, up-down) also makes it more tedious for comparisons between multiple countries.\r\nDifficult to search and compare between the two graphsThe intent of the creator is to show each country’s percentage of survey respondents who agreed or disagreed to vaccination, in an attempt to link it to how “pro-vaccine” a country is. As the order of the data in the graph on the left is in alphabetic order, it is visually challenging to see which country has the highest or lowest percentage for the different categories. On the other hand, the graph on the right is ordered in descending data values, which makes it clear which country has the highest or lowest “% strongly agreed to vaccination”.\r\nAs there are five categories that the data values ordering can be based on, the one that best conveys the intended message should be chosen. This will allow the audience to clearly see the message intended by the creator, and also make better comparisons within and across countries.\r\n8. Graph on right part of a replicate of graph on the left\r\nAs the % strongly agreed from the graph on the left is extracted and displayed in the graph on the right, there is no new information to be gained from the graph on the right if the graph on the left is ordered in the same way. It is also not clear that the two graphs are linked and how they are linked.\r\n9. No information provided on dataset used\r\nThe data source is not indicated in the visualisation, thus reducing the clarity on which dataset the visualisation is based on as there are many similar surveys conducted. The audience is not able to look deeper or clarify any doubts that they might have without knowing the dataset used.\r\nThe period of the data used is also not provided in the visualisation. This is important to give the audience the timeframe that the visualisation is based on, given that the Covid-19 situation is highly dynamic and is constantly evolving. Developments on the global and local disease threat, and vaccine development and procurement by individual countries would have an impact on the willingness of the public on the Covid-19 vaccination. Therefore the period that the data is based on is important to give the audience clarity on the situational context.\r\nAesthetics\r\n1. Choice of colour scale used\r\nThe creator used a qualitative colour scale to distinguish the categories of the five-point Likert Scale. As there is an intrinsic order to the categories, with “strongly agree” having a higher order than “agree”, and there is a sense of value of positive (“strongly agree”) and negative (“strongly disagree”), it would be more appropriate to utilise a diverging colour scale.\r\n2. Good aspect ratio used in cartesian coordinate system\r\nThe aspect ratio used ensures that any important differences in the length of the bars are noticeable in both graphs.\r\nAble to clearly see the differences in length of the bars3. X-axis range and units\r\nAs mentioned earlier, both x-axes starts at zero, which makes the bar lengths proportional and representative of the percentage amount. However, the x-axis for the graph on the right should have a axis label after the longest bar, so that it does not give an impression of truncation.\r\nNo label at the end of x-axis gives an impression of graph truncationThe x-axes titles and labels included the percentage units, which provides information to the audience on the units of the data. For consistency, the x-axis labels for both graphs should be aligned and rounded to the same decimal point, i.e. 20% or 20.0%.\r\nLabels in different decimal points4. Axes labels are difficult to read\r\nThe x and y axes labels for both graphs are consistent and clear, but are difficult to read as the font colour is in a lighter tone. The attention of the audience is also drawn to the axes titles due to the boldface and darker colour. The effect would have been better if the font colour and boldface is swapped between the axes titles and labels, making it easier for the audience to find their countries of interest and the corresponding range that the bar lengths fall within.\r\n(i) Without doing any inking, attention is drawn to the axes titles; (ii) faint axis lines and grid linesIn addition, the x-axis lines and grid lines are faint and are hardly visible in both graphs. A slightly darker colour would make it visible without placing too much emphasis on it, allowing the audience to focus on the bars and be able to reference to the axes labels when needed.\r\n(b) Proposed design\r\nSketch of proposed designThe proposed design consists of a number of components that attempt to address the issues highlighted above:\r\nVisualiation title and lead-in statements: highlight what the visualisation is about and provide some background information on the data and context\r\nInteractive components, namely being able to select parameters such as country, age, sex, household size, number of children in household, and employment status: allow exploration at the overall level while giving some flexibility to view the data of specific groups. Full range of countries to be provided, and to pre-set the country parameter to key countries so as not to over-crowd the initial visualisation\r\nTop-and-bottom placement of graphs: reduce the tendency to visually compare the two graphs\r\nLegend placed between graphs: reduce the distance of the legend from both graphs\r\nDiverging stacked bar chart with diverging colour scale for overview of data: accentuate the differences in the categories and aid in comparison of categories within each country and across countries\r\nTooltip mouseover for each category to contain breakdown of other fields in the data: provide insights on the possible reasons for the category chosen for the diverging stacked bar chart\r\nHorizontal bar chart with error bar for zoomed-in view of each category: provide a sense of the dynamic Covid-19 situation by including error bars to show the ranges that responses may fluctuate within. Added interactivity for audience to select the category and confidence level for the error bars\r\nData source: provide the link to the data source for easy access to the data used\r\nThe order for both graphs follows the original visualisation (alphabetic order for the diverging stacked bar chart and descending order for the horizontal bar chart with error bar). With the purpose of each graph to be explicitly included in the graph titles, there is no need to align the ordering as the purpose of the graphs is different.\r\n(c) Final product of proposed visualisation\r\nThe proposed visualisation is designed using Tableau and uploaded on Tableau Public. The link can be found here.\r\n(d) Step-by-step description to prepare the final product\r\n1. Place all relevant csv files into one folder\r\nExtract all zipped files and place all countries’ csv files into the same folder. For countries with missing vaccination fields, they are placed in a sub-folder “missing_vac”.\r\n\r\n2. Prepare the data tables\r\nFor each file with valid vaccination fields, delete all other fields except for “RecordNo”, “endtime”, “gender”, “age”, “household_size”, “household_children”, “employment_status”, “vac_1”, “vac2_1”, “vac2_2”, “vac2_3”, “vac2_6” and “vac_3”. The order of the fields are aligned in all the files.\r\n\r\nThere is no household_size, household_children and employment_status in the Israel dataset. The three columns were added in for alignment with the rest of the files.\r\nThe employment_status are coded differently for four countries (Denmark, Finland, Norway and Sweden). Instead of one field, there are seven fields for each employment status value in binary (Yes/No).\r\n\r\nRecoding is done in Excel to replace “Yes” values under each employment_status column to reflect the employment status value to align with the other files. The mapping is as shown:\r\n\r\nFor each file, the steps taken in Excel are:\r\nSelect entire column “employment_status_1”\r\nPress “Ctrl” + “F” to open the Find and Replace windowlet\r\nClick on “Replace” tab\r\nUnder “Find what:” and “Replace with:”, enter “Yes” and “Full time employment” respectively\r\nClick “Replace All”\r\n\r\nRepeat steps 1-5 to replace “No” values with blank\r\nRepeat steps 1-6 for the remaining six columns\r\nSave and close the file\r\nThe columns are then merged in Tableau and the data is exported to csv file, with the following steps for each file:\r\nOpen the file in Tableau\r\nSelect the columns to be merged\r\nRight-click and select “Merge Mismatch Fields”\r\n\r\nRename the merged column created to “Employment Status”\r\nAt the menu bar, select Data/Export Data to CSV and click on the file name\r\n\r\nSave the file\r\nAs the order of the columns and field names in the exported data from Tableau changed, the columns are reordered and renamed in Excel to be the same as the other files.\r\n3. Import data tables into Tableau\r\nOpen Tableau and click-and-drag (any) one file into Tableau.\r\n\r\nTableau will automatically show all the other files in the same folder under “Files”.\r\n\r\nRemove “australia.csv” from the workspace by clicking and dragging it out of the workspace.\r\nUnder “Files”, select all the relevant files and drag them into the workspace to combine all the data in the different files into one table.\r\n\r\nAfter combining, some repeated fields are noted, as indicated in the black box below.\r\n\r\nThe “Merge Mismatch Field” is used to combine similar fields together. After merging, the fields were reviewed and renamed accordingly. For “Table Name”, it was renamed to “Country”, and aliases were used to rename the filenames to country names.\r\nRight-click to select “Alias”Editing the aliasesThe data values under each field were checked through using the “Alias” option. It was noted that there were some issues with the Israel dataset after the union was made. However, as the issue cannot be resolved, Israel was removed from the analysis and visualisation.\r\nFor the vac fields, the extent of agreement and disagreement are explicitly spelt out.\r\n\r\nThe figure below shows the final table after data preparation.\r\n\r\n4. Create the diverging stacked bar chart\r\nTo create the graphs, move to Sheet 1 at the bottom of Tableau.\r\n\r\nSeveral calculated fields need to be created, as shown in the table below.\r\nField name\r\nFormula\r\nNumber of Records\r\n1\r\nTotal Count\r\nTOTAL(SUM([Number of Records]))\r\nCount Negative\r\nIF [vac_1]=“5 - Strongly disagree” THEN 1 ELSEIF [vac_1]=“4” THEN 1 ELSEIF [vac_1]=“3” THEN 0.5 ELSE 0 END\r\nTotal Count Negative\r\nTOTAL(SUM([Count Negative]))\r\nPercentage\r\nSUM([Number of Records])/[Total Count]\r\nGantt Start\r\n-[Total Count negative]/[Total Count]\r\nGantt Percent\r\nPREVIOUS_VALUE([Gantt Start])+ZN(LOOKUP([Percentage],-1))\r\nThe following steps are taken to create the calculated fields:\r\nUnder Data tab, click on the black dropdown arrow near the search bar and select “Create Calculated Field…”\r\n\r\nEnter the field name and formula as shown below.\r\n\r\nRepeat steps 1-2 for each calculated field\r\nThe next step would be to create the diverging stacked bar chart!\r\nAdd “Gantt Percent” and “Country” into Columns and Rows respectively\r\n\r\nAdd “vac_1” to Details in the Marks card\r\n\r\nUnder Columns, right-click “Gantt Percent”, go to Compute Using and select “vac_1”\r\n\r\nUnder the Marks card, change the chart type to “Gantt Bar”\r\n\r\nClick and drag “vac_1” into Colour in the Marks card\r\n\r\nClick and drag “Percentage” into Size in the Marks card\r\n\r\nClick and drag “vac_1” into the Filters card\r\n\r\nIn the windowlet, deselect Null and close the windowlet\r\n\r\nAt the legend, click on the black dropdown arrow and select “Edit Colors…” to change the colour palette. The Traffic Light palette is chosen to show that agreement in a positive tone (green), disagreement in a negative tone (red), and neutrality in paler colour (yellow). The strength of the response i.e. “strongly” is reflected by the intensity of the colour.\r\n\r\nAt the legend, click on the black dropdown arrow and select “Sort…”\r\n\r\nIn the windowlet, select “Descending” to place the negative responses on the left and positive responses on the right\r\n\r\nRight-click on the x-axis and deselect “Show Header” - x-axis removed as it would not be useful due to the negative figures. Any information on the values will be added in as a tooltip (covered in subsequent steps)\r\nThe base diverging stacked bar chart is now complete! The next step will be to add in the interactive features using the filters. The following are added as filters:\r\nGender\r\nAge\r\nEmployment Status\r\nHousehold Size\r\nHousehold Children\r\nMonth\r\nIn the earlier sketch, country was added as a filter as the initial thought was that there were many countries not reflected. However, due to data limitations, only 14 countries are shown, which is similar to the original visualisation.\r\nThe following steps are taken to add the filters:\r\nRight-click “Age” and select “Convert to Dimension”\r\n\r\nClick and drag the above mentioned dimensions to the Filters card\r\nFor Age, a windowlet will appear. Click all and select “Ok”\r\nRight-click “Age” and select “Continuous” \r\nA windowlet will appear. Click “OK”\r\n\r\nFor each filter, right-click and select “Show Filter”\r\nRe-arrange the filter cards by dragging it around the workspace\r\nThe filter cards were renamed for simplicity and changes were made to the filter controls by right-clicking the black dropdown arrow for each filter card\r\nFilter\r\nControl\r\nGender\r\nMultiple values (list)\r\nAge\r\nRange of values\r\nEmployment Status\r\nMultiple values (dropdown)\r\nHousehold Size\r\nMultiple values (dropdown)\r\nHousehold Children\r\nMultiple values (dropdown)\r\nMonth\r\nSingle value (list)\r\nThe last step would be to beautify the graph! A chart title is added and the legend was also shifted to the bottom of the graph and renamed to “Response”. The figure below shows the final graph.\r\n\r\n5. Create the graphs for the tooltip\r\nThe following steps are taken to create the graph for the tooltips:\r\nIn a new sheet, click and drag “vac2_1” into Rows and “Number of Records” into Columns\r\n\r\nClick on “Show Me” and select the “stacked bars”\r\n\r\nClick on the icon shown below to orientate the stacked bar chart horizontally\r\n\r\nClick and drag “vac2_1” into the filters and deselect Null values\r\n\r\nRight-click on the x-axis to edit the axis. Remove the title\r\n\r\nGo to the “Tick Marks” tab and select “None” under Major Tick Marks. Close the windowlet\r\n\r\nAt the legend on the right, click on the dropdown arrow to edit colours, similar to the diverging stacked bar chart.\r\n\r\nAdd in the survey question as the title of the sheet and resize the graph to be able to fit in the tooltip. Right-click the x-axis and unselect “Show Header”\r\nThe above steps are repeated for vac2_2, vac2_3, vac2_6 and vac_3. As a shortcut, the sheet for vac2_1 was duplicated, and the sheet title and variables were updated accordingly.\r\nBack at the diverging stacked bar chart sheet, select “Tooltip” under the Marks card. In the windowlet, enter in the survey response and click on Insert/Sheets and select the corresponding graphs. Resize the font accordingly to fit into the tooltip box.\r\n\r\nOther useful information are also added into the tooltip, as shown below.\r\n\r\nThe end product looks like this!\r\n\r\n6. Create the error bar on bar chart\r\nIn order to allow interactivity with the response and confidence level, two parameters need to be created: Response and Confidence Level.\r\nThe following steps are taken to create the parameters:\r\nAt the Data tab on the left panel, click on the black dropdown arrow and select “Create Parameter…”\r\n\r\nFor “Response”, enter the values shown in the figure below (note that the values can be added from dimensions):\r\n\r\nFor “Confidence Level”, enter the values shown in the figure below:\r\n\r\nThe following calculated fields need to be created for the error bar:\r\nField name\r\nFormula\r\nCount_Response\r\nIF [vac_1]=[Response] THEN 1 ELSE 0 END\r\nProp_Response\r\nSUM([Count_Response])/SUM([Number of Records])\r\nProp_Response_Margin of Error\r\n[Confidence Level](SQRT(([Prop_Response](1-[Prop_Response]))/SUM([Number of Records])))\r\nProp_Response_Lower\r\n[Prop_Response] - [Prop_Response_Margin of Error]\r\nProp_Response_Upper\r\n[Prop_Response] + [Prop_Response_Margin of Error]\r\nRefer to earlier steps on how to create calculated fields.\r\nNext, the error bar on bar chart is created taking the following steps:\r\nClick and drag “Prop_Response” to Columns and “Country” to Rows\r\nDrag Measure Values to the dual-axis line for the x-axis\r\n\r\nRemove all fields except for “Prop_Response_Lower” and “Prop_Response_Upper”\r\n\r\nRight-click the x-axis and select “Synchronize Axis”\r\n\r\nIn the Measure Values card, change the chart type to “Line”\r\n\r\nClick and drag “Measure Names” to \"Path\r\n\r\nClick and drag “vac_1” to Filters, and select all except Null\r\n\r\nTo show the parameters, right-click on the parameter names and select “Show Parameter”. Change the parameter options to “Single Value List”\r\n\r\nTo align the colour of the bar chart to the same colour palette used in the diverging stacked bar chart, click and drag “Response” to Colour in the AGG(Prop_Response) card.\r\n\r\nTo change the colours, toggle between the response values in the Parameter card and the legend. Use the same traffic light colour palette\r\n 11. Sort the graph in descending order\r\n\r\nOther amendments were made to beautify the graph, such as giving a title, amending the tooltip, removal of the dual x-axis header and colour legend, and aesthetic changes on the line thickness.\r\nThe final error bar on bar chart is shown below.\r\n\r\n7. Create the dashboard\r\nGo to the dashboard sheet by clicking on “New Dashboard” sheet at the bottom of Tableau. Under the Dashboard tab, go to Size and select “Automatic” from the dropdown list.\r\n\r\nAdd the dashboard title by clicking on checkbox “Show dashboard title” near the left bottom of the workspace. Click and drag a text object to the area under the dashboard title, as shown below. A windowlet will appear and enter the lead-in statements. A placeholder is shown in the subsequent figures.\r\n\r\nNext, click and drag the sheet “DivergingStacked” to the area below the lead-in statement.\r\n\r\nThen, click and drag the sheet “ErrorBar” to the space below the diverging stacked bar chart.\r\n\r\nEdit the necessary such as title and lead-in statements, and rearrange the tiles to fit the elements nicely. Add in blank objects where needed.\r\nAs the graphs have a scrollbar within the tiles, it does not aid the audience in maneuvering. At each of the graph tiles, click on the dropdown arrow, go to Fit and select “Fit Height”.\r\n\r\nThe blueprint of the final dashboard is as shown below, including the blank spaces that were added in.\r\n\r\n(e) Major observations revealed by the final product\r\nImpact of age and sex on willingness to take the Covid-19 vaccination\r\nIn general, people who are older tend to have stronger agreement with the statement to take the Covid-19 vaccination, as compared to people who are younger. This pattern can be observed quite visibly across countries, using the brushing technique on the Age slider bar.\r\nDiverging stacked bar chart by age group, with the youngest band at the bottom and oldest band at the topOf people falling in the the older age range, males are more likely to agree than females, as seen from comparing the diverging stacked bar chart for different sexes. Generally, males seems to be more willing, but the effect is more pronounced in the older age range.\r\nMatrix of graphs comparing age group and sexFear of side effects of the Covid-19 vaccine\r\nFrom the diverging stacked bar chart, it is observed that people who strongly disagree and disagree to taking the Covid-19 vaccine if they have the choice now are generally worried about the side effects of the vaccine. On the other hand, people who strongly agree and agree to taking the Covid-19 vaccine are less concerned on the vaccine’s side effects.\r\nTooltip across different countries and responses. Generally, the responses across countries are quite similarIn addition, among those who disagrees, their stand on not taking the vaccine actually dilutes over time. Looking at the response on whether Norwegians agree to take the vaccine one year from now, slightly more than half of those who strongly disagree now continues to disagree strongly to taking vaccination, whereas for those who disagrees now, more than half are agreeable or neutral.\r\nNorway’s disagree responses now on getting vaccinated one year onShould governments and public agencies want to encourage the public to be vaccinated, a possible strategy would be to target these groups’ concerns, which may have a good chance to change their minds.\r\nHigher uncertainty for less opinionated responses\r\nUsing the parameters option to explore the error bar patterns of the responses for different confidence intervals, it is observed the error bars are generally shorter for “1 - Strongly agree” and “5 - Strongly disagree”, meaning that the variation is not as large for people who give stronger responses. On the other hand, the error bars for people whose responses are not as strong or neutral are longer, meaning that these groups tend to be less predictable and are more likely to change their responses.\r\nComparing error bars of responses at 95% confidence levelFrom the above observations, we can see that the responses related to the Covid-19 vaccinations is still somewhat uncertain, with certain groups of people (different demographics, different countries) being more willing than others to be vaccinated. Strategies targeted at certain groups can be taken by the governments to influence the decisions of the individual, in the fight against the Covid-19 virus.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-03-10T14:33:50+08:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-01-06-dataviz-makeover-1/",
    "title": "My First DataViz Makeover",
    "description": "ISSS608 Visual Analytics and Applications - DataViz Makeover 1",
    "author": [
      {
        "name": "Amanda",
        "url": "https://example.com/amandatwl"
      }
    ],
    "date": "2021-01-26",
    "categories": [],
    "contents": "\r\nThe Data Visualisation\r\nSource: Report: Labour Force in Singapore 2019, Ministry of Manpower(a) Critique of current visualisation\r\nClarity\r\n1. No proper labelling of graph axes and units used in table\r\nThe visualisation has a chart title and sub-title to inform the audience that the graph shows data on resident labour force by age and the units are in per cent. However, the graph itself does not have the y-axis or its title or label, which lets the audience wonder what is the y-axis measure if one misses the small print of the chart sub-title.\r\nThe x-axis should be have a title to indicate that the data is grouped into age bands. The positioning of the x-axis just above the table values also created some confusion pertaining to the unit measure of the x-axis and y-axis. Therefore, in this visualisation, it is important to have proper axis titles and unit measures.\r\n2. Intended message not clearly conveyed by visualisation\r\nLooking at the visual alone (both graph and table), the message focus seems to be on the spread across the different age bands for the years 2009 and 2019, with two reference lines indicating the median age for each aforementioned year. The lead-in statements provide more information and numbers, and possible explanations for the shift in share of the resident labour force, which resulted in the increase in median age between 2009 and 2019. The lead-in statements further grouped the age bands (“aged 55 & over”, “aged 25 to 54”) in its description, which is inconsistent with the graph display. There is also mention of the Labour Force Participation Rate (LFPR) and its possible relationship with the labour force age, which is not reflected in the visualisation.\r\nWith reference to the original report on page 22, the entire visualisation and lead-in statements served to describe the trend that there are “more older residents in the labour force”. This message is not clearly conveyed by the visualisation and is only explicitly mentioned at the end of the lead-in statements.\r\nWhen put together, the audience is overwhelmed by the information provided in the lead-in statements and underwhelmed by the graph with no annotations to highlight the trends. Effective visualisations should work the other way round, where the lead-in statements should set the context and background succinctly, and the visualisation should convey the data and the intended message in a concise manner.\r\n3. Use of line chart with categorical data plotted on the x-axis\r\nLine charts are frequently used to display time-series data, with the time factor plotted on the x-axis. In this visualisation, data is plotted for two time periods (2009 and 2019) but are represented as two series on the chart area instead, with the age band categories indicated on the x-axis. The use of wrong chart type led to some initial confusion on what the graph is trying to convey.\r\n4. Labour force age patterns between 2009 and 2019 were not shown\r\nThe data for the years between 2009 and 2019 were not plotted on the graph, which diminishes the clarity of the visualisation. Questions on the integrity of the visualisation may also arise, such as whether the visualisation is trying to show what it wants the audience to see, or to hide certain trends that happened during those missing years.\r\n5. Data source and note on data values included in the visualisation\r\nIndicating the data source gives credibility to the visualisation and allows the audience to look into the data source in more detail. Adding a note to explain the rounding implication on summation of percentages is helpful to avoid questions from the more meticulous and detailed audience. The note also hinted that the data values shown are in percentages. The aesthetics could be further improved by aligning the two lines of text.\r\nAesthetics\r\n1. Clear differentiation between data lines and reference lines\r\nThe audience is able to quickly differentiate the data from the reference lines, as the data is made more obvious by using thicker lines and the reference lines are thinner and dotted.\r\n2. Well-placed labels on visualisation allows audience to identify groups of data\r\nThe visualisation has well-placed labels to differentiate between 2009 and 2019 for each data visualisation, namely the line graphs, reference lines and table values. This eliminated the need for a legend as the audience can immediately know the year represented by which line. In addition, the label for the median reference line included the median value, giving the audience the information upfront without having the need to trace the reference line to the x-axis to look for the median age.\r\nThe labels can be further improved by removing the word “June”, as the intended message is concerned with the age over a longer period of time (in years), and does not require the exact month that the data is based on.\r\n3. Consistent use of colours allows audience to distinguish groups of data\r\nThe visualisation defined a unique mapping between the data for each year and colour (grey for June 2009; blue for June 2019). This colour scheme is used consistently across the line graphs, reference lines and table, which makes it easier for the audience to locate and make comparisons in the visualisation. The colour palette used is kept simple, which makes the design of the visualisation clean and pleasant to look at.\r\n4. Use of background colour to highlight different parts of the visualisation\r\nThe change in background colour allows the audience to identify different parts of the visualisation. The audience is able to quickly see that the line graph elements are on the light grey background, whereas the table elements are on a dark-coloured background.\r\nThere is good contrast between the line graph and table. However, the attention of the audience is drawn to the table due to its darker colours. The background colour of the table can be improved by using lighter shades.\r\n(b) Proposed design\r\nSketch of proposed designThe proposed design attempts to convey the message that there are more older residents in the labour force more visually, while upholding the visualisation principles and best practices. The advantages of the proposed design are as follows:\r\nInformation in the original lead-in statements are represented graphically as much as possible, thus reducing the amount of text in the lead-in statements.\r\nTime factor is plotted on the x-axis with the appropriate use of stacked bar charts to visually differentiate between age bands.\r\nAs there are 12 age bands, logical grouping of age bands according to Singapore’s context helps to reduce the complexity of the visualisation and provide relevance to the Singaporean audience.\r\nLabour force age patterns for the entire time period from 2009 and 2019 are shown, providing a more complete story behind the data.\r\nUse of annotation to highlight and accentuate the intended message.\r\n(c) Final product of proposed visualisation\r\nThe proposed visualisation is designed using Tableau and uploaded on Tableau Public. The link can be found here.\r\n(d) Step-by-step description to prepare the final product\r\n1. Verify data source of original visualisation\r\nRaw data for number of residents by age bands and median age from 2009 to 2019 were found in two separate Excel files, renamed to T7 and T2 respectively. It was noted that there are multiple worksheets in T7, showing the overall number of residents by age bands and by sex.\r\nT7T22. Import relevant data tables into Tableau\r\nThe two Excel files were imported as separate data sources, shown in the figure below.\r\nImporting Excel files into TableauThe table containing the overall number of residents is found in T7_T worksheet. Both tables T7_T and T2 were connected as table datas in Tableau.\r\n3. Prepare and clean the data\r\nMany null values were detected by Tableau after import, as the data tables in the Excel files were formatted for easy reading and reporting. The figure below shows T7_T after importing in Tableau.\r\nRaw file in TableauThe Tableau function Data Interpreter was used for the initial data cleaning. The figures below show the resulting tables after using Data Interpreter.\r\nT7_T after Tableau Data InterpreterT2 after Tableau Data InterpreterThe table below shows the changes made to the respective tables:\r\nFor T7_T\r\nFor T2\r\nHid column F1\r\nHid all other columns except for Labour Force Participation Rate (%) and Median Age of Labour Force (Years)\r\nRenamed Age (Years) 2 to Age_band\r\nRenamed June to Year and changed the data type to “Date”\r\nPivoted columns containing years\r\nRenamed Labour Force Participation Rate (%) to LFPR (%)\r\nRenamed Pivot Field Names to Year and changed the data type to “Date”\r\nRenamed Median Age of Labour Force (Years) to Median Age (Years)\r\nRenamed Pivot Field Values to No_residents\r\nAdded filter to remove empty rows\r\nAdded filter to remove the Total across age bands (null values under Age_band)\r\n\r\nLabour Force Participation Rate was retained in the data table as it was mentioned in the original visualisation. The use of the data would be explored in later steps.\r\nThe figures below show the cleaned versions of the two data tables.\r\nCleaned T7_TCleaned T24. Create the stacked bar graph\r\nThe following steps were taken to create the stacked bar graph:\r\nUsing T7_T data, drag Year to “Columns”, Age_band and No_residents to “Rows”.\r\nClick on “Show Me” and select the stacked bar chart option.\r\nSelecting stacked bar chart option under Show MeUnder SUM(No_residents) dropdown list, select “Quick Table Calculations” - “Percent of Total”, and under the same dropdown list, select “Compute Using” - “Age_band”.\r\nAdding Quick Table Calculations using Percent of TotalChanging the calculation to be based on Age_bandAt the legend, select “15 - 19” and “20 - 24”, right-click and select “Group”. A new measure Age_band (group) appears under the data list.\r\nCreating a group from the legend cardRight-click the measure Age_band (group) and select “Edit Group…”.\r\nEditing groups from the data listAt the pop-up window, create two other groups for ages between 25 to 54 and 55 and above.\r\nCreating groups for Age_bandRename the groups created to reflect the start and end ages.\r\nSort the Age_band (group) in descending order, as human perception of increasing trend is from down to up.\r\nSorting the Age_band (group) in descending order5. Add the median age line to the graph\r\nThe following steps were taken to add the median age line to the stacked bar graph:\r\nGo to “T2 (T2)” under the data list, select Median Age (Years) and drag to the right side of the graph.\r\nUnder Marks card, SUM(Median Age (Years)) sub-card, change the display from “Bar” to “Line”.\r\nMedian Age with original axis rangeRemove the Age_band (group) and Measure Names from the SUM(Median Age (Years)) sub-card.\r\nEdit the axis and change the range to “Fixed” from 0 to 80. This is to bring the line down to within the 25 to 54 age band group to give a more accurate picture of the data. The number 80 was chosen arbitrary to represent the age of the oldest resident in the labour force, which does not fall far from the truth.\r\nMedian Age with fixed axis range6. Add meaning to the graph\r\nWith the base graph, the next step would be to add meaning to the graph through aesthetics. The following changes are made in the Sheet view:\r\nThe colour palette of the stacked bar graph was changed to show a single-colour gradient over the three groups, so that the shift in trend is more obvious. The darker end of the colour gradient is chosen to represent older age bands, so that the attention is brought to that group.\r\nAfter changing the colour palette of the stacked bar graphThe colour of the Median Age (Year) line was edited and markers were added. However, as the markers for the line chart are too small (unable to change the size due to limitations in the software), the display was changed from “Line” to “Circle” instead. The overall effect is better when labels and trend line were added.\r\nOriginal line graph with markers and labels addedChanging the shape to circles and adding a trend lineTitles and labels were edited for layman understanding.\r\nData source and note on the summation of percentages were added as part of the graph caption.\r\nAnnotation for points was added to highlight the increase and decline in share of residents for 55 and above and 25 to 54 groups respectively. Key words are in boldface and made larger to capture attention. As the Tableau annotation can only link to one point, another annotation for point was overlaid (with no fill and borders) to create an annotation that links to two points.\r\nUsing empty annotation for point to create the second linkAs the Sheet view of Tableau only catered for chart title, the title of the visualisation and lead-in statements were added to the visualisation using the Tableau Dashboard feature. The steps taken are as follows:\r\nThe size of the dashboard is kept at a fixed size of 1024 x 768 (full screen). This is to ensure that the position of the annotations do not change when it automatically resizes the visualisation.\r\nTitle and a text object were added on the Dashboard view for the visualisation title and lead-in statement respectively.\r\nThe caption was\r\nAs the location of the legend was too near the top, a blank object was added to bring the legend closer to the part of the graph where the two age groups meet.\r\nThe caption created from the Sheet view was explicitly made to show on the Dashboard view.\r\nA screen capture of the final product in Tableau Dashboard is shown below.\r\nFinal visualisation(e) Major observations revealed by the final product\r\nThe message of the visualisation is clearly shown from the title and a brief lead-in statement shares on the possible factors that caused the increase in older residents in the labour force. The annotations highlight key points revealed by the graph, which supports the message.\r\nBesides conveying the original intended message, other major observations can also be made from the final proposed visualisation:\r\n1. Rate of change of percentage of labour force by age groups and median age of labour force\r\nWhile the increase in median age seems gradual (median age stayed at 43 from 2014 to 2018), the increase in the percentage of older residents in the labour force seems to be at a faster pace over the same period of time. The graph also seems to hint that the median age could increase and fall within the 55 & above age group in the next 10 to 20 years. This has implications on government policy planning and also for corporate organisations in planning for an older employee population.\r\n2. Proportion of labour force by age groups over time\r\nFrom the final product, it is visually more prominent that the percentage of labour force in the 15 to 24 age group is rather constant and hovers around 10%, and that there is an obvious shift of the proportion from the 25 to 54 age group to the 55 & above age group. This causes concern and may trigger authorities to think of ways to increase the labour force aged 24 and below.\r\n3. More questions!\r\nBased on the above two observations, more questions on the linkage between labour force, working population, unemployment rates and birth rates surfaced. Some of these are identified in the lead-in statement as factors that may have an impact on the resident labour force and the median age. The audience may be curious as to what exactly is the relationship and pattern of these other factors. As this dataviz is focused on re-visualising the current message, the additional data is not included in the proposed visualisation. It would be more informative if the data of the aforementioned factors can be placed in the same view (as a dashboard) to give a more accurate and complete picture of the trends in the Singapore labour force.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-01-28T18:21:18+08:00",
    "input_file": {}
  },
  {
    "path": "posts/welcome/",
    "title": "Welcome!",
    "description": {},
    "author": [
      {
        "name": "Amanda",
        "url": "https://mydatastory.netlify.app/about.html"
      }
    ],
    "date": "2021-01-25",
    "categories": [],
    "contents": "\r\nHello there! This is my web blog as I embark on my journey in data analytics and visualisation. Hope you will enjoy reading my posts!\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-03-13T07:33:01+08:00",
    "input_file": "welcome.utf8.md"
  }
]
