[
  {
    "path": "posts/welcome/",
    "title": "Welcome!",
    "description": "Welcome to my new blog, DataViz Makeover Blog. I hope you enjoy \nreading my posts!",
    "author": [
      {
        "name": "Amanda",
        "url": "https://example.com/amandatwl"
      }
    ],
    "date": "2021-01-26",
    "categories": [],
    "contents": "\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-01-26T15:49:08+08:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-01-06-dataviz-makeover-1/",
    "title": "My First DataViz Makeover",
    "description": "ISSS608 Visual Analytics and Applications - DataViz Makeover 1",
    "author": [
      {
        "name": "Amanda",
        "url": "https://example.com/amandatwl"
      }
    ],
    "date": "2021-01-26",
    "categories": [],
    "contents": "\r\nThe Data Visualisation\r\nSource: Report: Labour Force in Singapore 2019, Ministry of Manpower(a) Critique of current visualisation\r\nClarity\r\n1. No proper labelling of graph axes and units used in table\r\nThe visualisation has a chart title and sub-title to inform the audience that the graph shows data on resident labour force by age and the units are in per cent. However, the graph itself does not have the y-axis or its title or label, which lets the audience wonder what is the y-axis measure if one misses the small print of the chart sub-title.\r\nThe x-axis should be have a title to indicate that the data is grouped into age bands. The positioning of the x-axis just above the table values also created some confusion pertaining to the unit measure of the x-axis and y-axis. Therefore, in this visualisation, it is important to have proper axis titles and unit measures.\r\n2. Intended message not clearly conveyed by visualisation\r\nLooking at the visual alone (both graph and table), the message focus seems to be on the spread across the different age bands for the years 2009 and 2019, with two reference lines indicating the median age for each aforementioned year. The lead-in statements provide more information and numbers, and possible explanations for the shift in share of the resident labour force, which resulted in the increase in median age between 2009 and 2019. The lead-in statements further grouped the age bands (“aged 55 & over”, “aged 25 to 54”) in its description, which is inconsistent with the graph display. There is also mention of the Labour Force Participation Rate (LFPR) and its possible relationship with the labour force age, which is not reflected in the visualisation.\r\nWith reference to the original report on page 22, the entire visualisation and lead-in statements served to describe the trend that there are “more older residents in the labour force”. This message is not clearly conveyed by the visualisation and is only explicitly mentioned at the end of the lead-in statements.\r\nWhen put together, the audience is overwhelmed by the information provided in the lead-in statements and underwhelmed by the graph with no annotations to highlight the trends. Effective visualisations should work the other way round, where the lead-in statements should set the context and background succinctly, and the visualisation should convey the data and the intended message in a concise manner.\r\n3. Use of line chart with categorical data plotted on the x-axis\r\nLine charts are frequently used to display time-series data, with the time factor plotted on the x-axis. In this visualisation, data is plotted for two time periods (2009 and 2019) but are represented as two series on the chart area instead, with the age band categories indicated on the x-axis. The use of wrong chart type led to some initial confusion on what the graph is trying to convey.\r\n4. Labour force age patterns between 2009 and 2019 were not shown\r\nThe data for the years between 2009 and 2019 were not plotted on the graph, which diminishes the clarity of the visualisation. Questions on the integrity of the visualisation may also arise, such as whether the visualisation is trying to show what it wants the audience to see, or to hide certain trends that happened during those missing years.\r\n5. Data source and note on data values included in the visualisation\r\nIndicating the data source gives credibility to the visualisation and allows the audience to look into the data source in more detail. Adding a note to explain the rounding implication on summation of percentages is helpful to avoid questions from the more meticulous and detailed audience. The note also hinted that the data values shown are in percentages. The aesthetics could be further improved by aligning the two lines of text.\r\nAesthetics\r\n1. Clear differentiation between data lines and reference lines\r\nThe audience is able to quickly differentiate the data from the reference lines, as the data is made more obvious by using thicker lines and the reference lines are thinner and dotted.\r\n2. Well-placed labels on visualisation allows audience to identify groups of data\r\nThe visualisation has well-placed labels to differentiate between 2009 and 2019 for each data visualisation, namely the line graphs, reference lines and table values. This eliminated the need for a legend as the audience can immediately know the year represented by which line. In addition, the label for the median reference line included the median value, giving the audience the information upfront without having the need to trace the reference line to the x-axis to look for the median age.\r\nThe labels can be further improved by removing the word “June”, as the intended message is concerned with the age over a longer period of time (in years), and does not require the exact month that the data is based on.\r\n3. Consistent use of colours allows audience to distinguish groups of data\r\nThe visualisation defined a unique mapping between the data for each year and colour (grey for June 2009; blue for June 2019). This colour scheme is used consistently across the line graphs, reference lines and table, which makes it easier for the audience to locate and make comparisons in the visualisation. The colour palette used is kept simple, which makes the design of the visualisation clean and pleasant to look at.\r\n4. Use of background colour to highlight different parts of the visualisation\r\nThe change in background colour allows the audience to identify different parts of the visualisation. The audience is able to quickly see that the line graph elements are on the light grey background, whereas the table elements are on a dark-coloured background.\r\nThere is good contrast between the line graph and table. However, the attention of the audience is drawn to the table due to its darker colours. The background colour of the table can be improved by using lighter shades.\r\n(b) Proposed design\r\n The proposed design attempts to convey the message that there are more older residents in the labour force more visually, while upholding the visualisation principles and best practices. The advantages of the proposed design are as follows:\r\nInformation in the original lead-in statements are represented graphically as much as possible, thus reducing the amount of text in the lead-in statements\r\nTime factor is plotted on the x-axis with the appropriate use of stacked bar charts to visually differentiate between age bands\r\nAs there are 12 age bands, logical grouping of age bands according to Singapore’s context helps to reduce the complexity of the visualisation and provide relevance to the Singaporean audience\r\nLabour force age patterns for the entire time period from 2009 and 2019 are shown, providing a more complete story behind the data\r\nUse of annotation to highlight and accentuate the intended message\r\n(c) Final product of proposed visualisation\r\nThe proposed visualisation is designed using Tableau and uploaded on Tableau Public. The link can be found here.\r\n(d) Step-by-step description to prepare the final product\r\nVerify data source of original visualisation\r\nRaw data for number of residents by age bands and median age from 2009 to 2019 were found in two separate Excel files T7 and T2 respectively\r\nThere are multiple worksheets in T7, showing the overall number of residents by age bands and by sex\r\n\r\nImport relevant data tables into Tableau\r\nThe two Excel files were imported as separate data sources\r\nMany null values were detected by Tableau after importing, as the data tables in the Excel files were formatted for easy reading and reporting\r\nThe Tableau function Data Interpreter was used for the initial cleaning to remove the null values\r\nAs the years were expressed as column headers in the data table on number of residents by age bands and as row values in the data table on median age, were\r\n\r\nRelevant data values in EXCELThe EXCEL file was imported into Tableau. The data type of each variable were checked and the data was prepared The data types of each variable were checked and the data\r\n(e) Major observations revealed by the final product\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-01-28T00:29:59+08:00",
    "input_file": "dataviz-makeover-1.utf8.md"
  }
]
